Revit 2027 API
FormulaManager.Validate Method
 Validates the formuls
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Validate(
	ElementId parameterId,
	Document document,
	string formula
)
Public Shared Function Validate (
	parameterId As ElementId,
	document As Document,
	formula As String
) As String
public:
static String^ Validate(
	ElementId^ parameterId,
	Document^ document,
	String^ formula
)
static member Validate :
        parameterId : ElementId *
        document : Document *
        formula : string -> string
Parameters
parameterId ElementId
document Document
formula String
Return Value
String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 It validates formula using list of global or family parameters depends on document type.
See Also
Reference
FormulaManager Class
Autodesk.Revit.DB Namespace